# Pandas

In [2]:
import sys
sys.path.append("/System/Library/Frameworks/Python.framework/Versions/2.7/Extras/lib/python")
sys.path.append("/System/Library/Frameworks/Python.framework/Versions/2.7/Extras/lib/python")
sys.path.append("/Library/Python/2.7/site-packages")

In [3]:
import pandas as pd

In [4]:
frame = pd.read_csv("dataset.tsv", sep = "\t", header = 0)
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [5]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [6]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [66]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [22]:
frame.fillna("huy", inplace = True)

In [7]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [24]:
frame.Position

0         huy
1     инженер
2    менеджер
3         huy
4     инженер
5      стажер
Name: Position, dtype: object

In [26]:
frame[["Name", "Position"]]

              Name  Position
0      Иванов А.А.       huy
1     Сорокин И.В.   инженер
2       Белов М.М.  менеджер
3  Мельникова Д.С.       huy
4      Рыбина Е.П.   инженер
5     Костров С.О.    стажер

In [27]:
frame[1:3]

           Name      Birth       City  Position
1  Сорокин И.В. 1965-07-08  Волгоград   инженер
2    Белов М.М. 1980-02-13     Ростов  менеджер

In [28]:
frame.loc[[1, 5], ["Name", "City"]]

           Name       City
1  Сорокин И.В.  Волгоград
5  Костров С.О.     Москва

In [60]:
frame

(False, True)

In [33]:
frame[frame.Birth > pd.datetime(1985, 1, 1)]

              Name      Birth    City Position
3  Мельникова Д.С. 1985-04-15  Ростов      huy
4      Рыбина Е.П. 1985-11-19  Москва  инженер
5     Костров С.О. 1985-05-31  Москва   стажер

In [59]:
frame.isStudent = [False, True]

AttributeError: 'tuple' object has no attribute 'isStudent'

In [93]:
frame1 = frame

In [80]:
frame1.isStudent = [True, False]

In [96]:
frame1.addColumn()

AttributeError: 'DataFrame' object has no attribute 'addColumn'

In [95]:
frame1["isStudent"] = True, False, False, False, False, True

In [85]:
frame1

              Name      Birth       City  Position  isStudent
0      Иванов А.А. 1980-03-22     Москва       NaN       True
1     Сорокин И.В. 1965-07-08  Волгоград   инженер      False
2       Белов М.М. 1980-02-13     Ростов  менеджер      False
3  Мельникова Д.С. 1985-04-15     Ростов       NaN      False
4      Рыбина Е.П. 1985-11-19     Москва   инженер      False
5     Костров С.О. 1985-05-31     Москва    стажер       True